IDEA Open Model
CountryCode Enumeration
Compatible with IDEA StatiCa Beta 20.0
 CountryCode
 Namespace: IdeaRS.OpenModel
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.2
Syntax
public enum CountryCode
Public Enumeration CountryCode
Members
Member name | Value | Description
None | 0 |  no code
ECEN | 1 |  Eurocode
India | 5 |  India code
SIA | 6 |  Swiss code
American | 8 |  American design code as ACI, AISC, ASTM standards etc.
Canada | 9 |  Canadian design code
Australia | 10 |  Australian design code
RUS | 11 |  Russia design code
CHN | 12 |  China design code
HKG | 13 |  Hong Kong design code
See Also
Reference
IdeaRS.OpenModel Namespace